

let numOrStr = prompt('input number or string');
console.log(numOrStr)

switch(true){
    case numOrStr === null:
        console.log('ви скасували');
        break;
    case  numOrStr.trim() === '':
        console.log('Empty String');
        break;
    case isNaN (+numOrStr):
        console.log('number is Ba_NaN');
        break;
    default:
        console.log('OK!');
}




































// !!! Примітки для себе !!!

// prompt() - виводить діалогове вікно з полем для вводу.
// alert() - виводить повідомлення.
// confirm() - виводить повідомлення з кнопкою Ок і Скасувати.
// var / let - перемінна змінна
// const - неперемінна змінна
// concatenatedResult - це змінна що об'єднує значення рядків, які користувач ввів у змінні 
// if (умова) {} - оператор для умовного виконання коду. (умова) - це вираз, який оцінюється на істинність або хибність.
// else {} - (перевірка if) - використовується для встановлення альтернативного дії, яка виконується, якщо умова в операторі if не виконується.
// !isNaN(inputNumber) - перевіряє чи введене значення є числом.
// "!" - в цьому виразі інвертує результат, тобто умова виконується, якщо inputNumber є числом.
// inputNumber.length === 5 - умова перевіряє, чи довжина рядка inputNumber дорівнює 5.
// .split('') - розбиває значення inputNumber на окремі символи (цифри).
// .join(' ') - з*єднює значення inputNumber.split('') використовуючи пробіли між ними. 
// == (порівняння за значенням) - оператор порівнює значення на рівність без порівняння типів даних. (1 = '1')
// === (строге порівняння) - оператор порівнює значення та типи даних (1 не = '1')
// && - це логічний оператор, використовується для комбінування двох чи більше логічних виразів і повертає 'true' тільки тоді, коли всі вирази, які з'єднуються за допомогою &&, є істинними.
// parseFloat - це функція, яка перетворює рядок у число з плаваючою комою або у NaN (Не-число), якщо рядок неможливо перетворити у число.
// "add" ----- "додавання".
// "difference" ----- "віднімання".
// "product" ----- "множення".
// "division" ----- "ділення".
// !== - це оператор строгої нерівності, який використовується для порівняння двох значень. В даному контексті !== 0 ? перевіряє, чи значення (наприклад num2) не рівне значенню справа від оператора (нуль).
// .trim() - це метод рядка в JavaScript, який використовується для видалення пропусків з початку і кінця рядка. 
// switch - ключове слово, що позначає початок конструкції switch.
// case - ключове слово, яке визначає можливий варіант для порівняння з виразом.    
// break - ключове слово, яке вказує на закінчення виконання конструкції switch. Після виконання коду в одному з case, програма виходить з конструкції switch, якщо не встановлено break.
// default - необов'язковий блок, який виконується, коли значення виразу в switch не відповідає жодному case. Він діє як альтернатива, якщо немає відповідних case.